БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеПользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДокументовКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДокументовКомплекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПользователиЛКК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПользователиЛКК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПечатныеФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентифкаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофилиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофилиЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВебПрофили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхива</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыФиксацииКолонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БыстрыйОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФормат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеТипаЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ЛичныйКабинетКлиентаСервер/Ext/Module.bsl
// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт

	ОписаниеПодсистем.Вставить("CW_ЛичныйКабинетКлиента", "8.3.7.9");

КонецПроцедуры    

// Процедура - При создании на сервере
//  ВЫзывается при создании формы рабочего стола
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.ИспользуетсяЛичныйКабинет = ПолучитьФункциональнуюОпцию("CW_ЛичныйКабинетИспользуется");
	Если Форма.ИспользуетсяЛичныйКабинет Тогда
		CW_ОбщийМодульЛичныйКабинетСервер.СоздатьОбновитьПользователяЛичногоКабинета();
	КонецЕсли;

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("CW_ГруппаПользователя", ГруппаПользователя); 
	ЛичныйКабинетУправлениеПрофилями = ПолучитьФункциональнуюОпцию("CW_ЛичныйКабинетУправлениеПрофилямиДоступа", ПараметрыОпции);
	
	Форма.Элементы.СтраницаЛичныйКабинет.Видимость = Форма.ИспользуетсяЛичныйКабинет и ЛичныйКабинетУправлениеПрофилями;
	
КонецПроцедуры        

Функция ПолучитьДанныеПользователя(ИмяПользователя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПользователиЛКК.Ссылка КАК Пользователь,
	               |	CW_ВебПользователиЛКК.ВыгружатьПечатныеФормы КАК ВыгружатьПечатныеФормы,
	               |	CW_ВебПользователиЛКК.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ВебПользователиЛКК.Язык КАК Язык
	               |ИЗ
	               |	Справочник.CW_ВебПользователиЛКК КАК CW_ВебПользователиЛКК
	               |ГДЕ
	               |	CW_ВебПользователиЛКК.ЭлектроннаяПочта = &ИмяПользователя";
	
	Запрос.УстановитьПараметр("ИмяПользователя", ИмяПользователя);
	РезультатЗапроса = Запрос.Выполнить();   
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("Пользователь", 			Выборка.Пользователь);
		ДанныеПользователя.Вставить("ВыгружатьФайлы", 			Выборка.ВыгружатьФайлы);
		ДанныеПользователя.Вставить("ВыгружатьПечатныеФормы", 	Выборка.ВыгружатьПечатныеФормы);
		ДанныеПользователя.Вставить("Язык", 					Выборка.Язык);
		Возврат ДанныеПользователя;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьПрофилиПользователя(ДанныеПользователя, ОсновнойПрофиль=Неопределено, Раздел) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПользователиВебПрофилей.Пользователь КАК Пользователь,
	               |	CW_ПользователиВебПрофилей.ОсновнойПрофиль КАК ОсновнойПрофиль,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль КАК ВебПрофиль,
	               |	CW_ПользователиВебПрофилей.Основной КАК Основной,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль.ПредставлениеRU КАК ПредставлениеRU,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль.ПредставлениеEN КАК ПредставлениеEN,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль.РазрешеноПрикреплятьФайлы КАК РазрешеноПрикреплятьФайлы,
	               |	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ДоступноСозданиеЗавок КАК ДоступноСозданиеЗавок
	               |ИЗ
				   |	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
				   |ГДЕ
				   |	CW_ПользователиВебПрофилей.Раздел = &Раздел
				   |	И CW_ПользователиВебПрофилей.Пользователь = &Пользователь
				   |	И CW_ПользователиВебПрофилей.ВебПрофиль.Активный = ИСТИНА
				   |	//Условие_ОсновнойПрофиль 
				   |
				   |УПОРЯДОЧИТЬ ПО
	               |	Основной УБЫВ"; 
	
	Запрос.УстановитьПараметр("ОсновнойПрофиль",	ОсновнойПрофиль);
	Запрос.УстановитьПараметр("Раздел", 			Раздел);
	Запрос.УстановитьПараметр("Пользователь", 		ДанныеПользователя.Пользователь);  
	
	Если ЗначениеЗаполнено(ОсновнойПрофиль) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Условие_ОсновнойПрофиль", "И CW_ПользователиВебПрофилей.ОсновнойПрофиль = &ОсновнойПрофиль");	
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПараметрыПрофиляПользователя(ДанныеПользователя) Экспорт
	
	ПараметрыПрофиля = Новый Структура("ДоступенМониторинг, ДоступенЗаявки, ДоступенДокументы, ДоступенОтчеты, УведомлятьОЗадолженности", Ложь, Ложь,Ложь,Ложь,Ложь);
	
	Запрос = новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Пользователь", ДанныеПользователя.Пользователь);  
	
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ПользователиВебПрофилей.ВебПрофиль КАК ВебПрофиль,
	|	CW_ПользователиВебПрофилей.ВебПрофиль.Владелец КАК ОсновнойПрофиль,
	|	CW_ПользователиВебПрофилей.Раздел КАК Раздел
	|ПОМЕСТИТЬ ВТ_ДоступныеПрофили
	|ИЗ
	|	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	|ГДЕ
	|	CW_ПользователиВебПрофилей.Пользователь = &Пользователь
	|	И CW_ПользователиВебПрофилей.ВебПрофиль.Активный = ИСТИНА"; 
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ДоступныеПрофили.ВебПрофиль КАК ВебПрофиль,
	|	ВТ_ДоступныеПрофили.ОсновнойПрофиль КАК ОсновнойПрофиль,
	|	ВТ_ДоступныеПрофили.Раздел КАК Раздел
	|ИЗ
	|	ВТ_ДоступныеПрофили КАК ВТ_ДоступныеПрофили
	|ГДЕ
	|	ВТ_ДоступныеПрофили.Раздел = ""ГРУЗОПЕРЕВОЗКИ""";

	РезультатЗапроса = Запрос.Выполнить();     
	ПараметрыПрофиля.Вставить("ДоступенМониторинг", НЕ РезультатЗапроса.Пустой());
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ДоступныеПрофили.ВебПрофиль КАК ВебПрофиль,
	|	ВТ_ДоступныеПрофили.ОсновнойПрофиль КАК ОсновнойПрофиль,
	|	ВТ_ДоступныеПрофили.Раздел КАК Раздел
	|ИЗ
	|	ВТ_ДоступныеПрофили КАК ВТ_ДоступныеПрофили
	|ГДЕ
	|	ВТ_ДоступныеПрофили.Раздел = ""ЗАЯВКИ""";
	
	РезультатЗапроса = Запрос.Выполнить();     
	ПараметрыПрофиля.Вставить("ДоступенЗаявки", НЕ РезультатЗапроса.Пустой());
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(CW_ВебПрофили.ВыводитьФинансовыеДокументы) КАК ДоступныхДокументы,
	|	МАКСИМУМ(CW_ВебПрофили.ВыводитьЗадолженность) КАК ДоступныОтчеты,
	|	МАКСИМУМ(CW_ВебПрофили.УведомлятьОЗадолженности) КАК УведомлятьОЗадолженности
	|ИЗ
	|	РегистрСведений.CW_ДоступныеПользователи КАК CW_ДоступныеПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	|		ПО CW_ДоступныеПользователи.ВебПрофиль = CW_ВебПрофили.Ссылка
	|ГДЕ
	|	CW_ДоступныеПользователи.Пользователь = &Пользователь";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	 = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ПараметрыПрофиля, Выборка);
	КонецЕсли; 
	
	Возврат ПараметрыПрофиля;
	
КонецФункции

Процедура ПолучитьОсновыеПрофилиПользователя(Пользователь, МассивПрофилей)   Экспорт

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеПользователи.ВебПрофиль КАК ВебПрофиль,
	               |	CW_ДоступныеПользователи.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеПользователи КАК CW_ДоступныеПользователи
	               |ГДЕ
	               |	CW_ДоступныеПользователи.Пользователь = &Пользователь";  
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		  МассивПрофилей.Добавить(Выборка.ВебПрофиль);
	КонецЦикла;
	
КонецПроцедуры  

Функция ПолучитьДанныеПрофиляГрузоперевозок(Профиль) ЭКспорт
	
	ДанныеПрофиля = Новый Структура("Ссылка,ПредставлениеНаРусском,ПредставлениеНаАнглийском,ВыгружатьФайлы,ВыводитьФинансовыеДокументы,ВыводитьЗадолженность,УведомлятьОЗадолженности");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофили.Ссылка КАК Ссылка,
	               |	CW_ВебПрофили.ПредставлениеНаРусском КАК ПредставлениеНаРусском,
	               |	CW_ВебПрофили.ПредставлениеНаАнглийском КАК ПредставлениеНаАнглийском,
	               |	CW_ВебПрофили.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ВебПрофили.ОсновнойПрофиль.ВыводитьФинансовыеДокументы КАК ВыводитьФинансовыеДокументы,
	               |	CW_ВебПрофили.ОсновнойПрофиль.ВыводитьЗадолженность КАК ВыводитьЗадолженность,
	               |	CW_ВебПрофили.ОсновнойПрофиль.УведомлятьОЗадолженности КАК УведомлятьОЗадолженности
	               |ИЗ
	               |	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	               |ГДЕ
	               |	CW_ВебПрофили.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 	Профиль);
	
	Выборка =  Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПрофиля, Выборка);
	КонецЕсли;
	
	Возврат ДанныеПрофиля;
	
КонецФункции  

Функция ПолучитьДанныеПрофиляЗаявок(Профиль) ЭКспорт
	
	ДанныеПрофиля = Новый Структура("Ссылка,ПредставлениеRU,ПредставлениеEN,ДоступенВыводНаАнглийскомЯзыке,ВыгружатьФайлы,РазрешеноПрикреплятьФайлы,ВыводитьТипФайла");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофилиЗаявок.Ссылка КАК Ссылка,
	               |	CW_ВебПрофилиЗаявок.ПредставлениеRU КАК ПредставлениеRU,
	               |	CW_ВебПрофилиЗаявок.ПредставлениеEN КАК ПредставлениеEN,
	               |	CW_ВебПрофилиЗаявок.ДоступенВыводНаАнглийскомЯзыке КАК ДоступенВыводНаАнглийскомЯзыке,
	               |	CW_ВебПрофилиЗаявок.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ВебПрофилиЗаявок.РазрешеноПрикреплятьФайлы КАК РазрешеноПрикреплятьФайлы,
	               |	CW_ВебПрофилиЗаявок.ВыводитьТипФайла КАК ВыводитьТипФайла
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок
	               |ГДЕ
	               |	CW_ВебПрофилиЗаявок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 	Профиль);
	
	Выборка =  Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПрофиля, Выборка);
	КонецЕсли;
	
	Возврат ДанныеПрофиля;
	
КонецФункции

Функция ПолучитьМассивГрузоперевозок(Счет)
	
	Если ТипЗнч(Счет) <> Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Возврат новый Массив;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Счет";
	
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
КонецФункции

Функция ПолучитьМассивЗаказов(Счет)
	
	Если ТипЗнч(Счет) <> Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Возврат новый Массив;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Счет";
	
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Заказ");
	
КонецФункции

Функция ПолучитьПараметрыКомплекта(КомплектПечатныхФорм) Экспорт
	
	Ответ = Новый Структура;   
	
	//Счета
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаКомплекта", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет"));
	
	мСтроки = КомплектПечатныхФорм.СоставКомплекта.НайтиСтроки(Отбор);
	Ответ.Вставить("УказанаПечатнаяФормаСчета", мСтроки.Количество() > 0);
	
	//Реализации
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаКомплекта", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Реализация"));
	
	мСтроки = КомплектПечатныхФорм.СоставКомплекта.НайтиСтроки(Отбор);
	Ответ.Вставить("УказанаПечатнаяФормаРеализации", мСтроки.Количество() > 0);
	
	//Отчет экспедитора
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаКомплекта", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.ОтчетЭкспедитора"));
	
	мСтроки = КомплектПечатныхФорм.СоставКомплекта.НайтиСтроки(Отбор);
	Ответ.Вставить("УказанаПечатнаяФормаОтчетаЭкспедитора", мСтроки.Количество() > 0);
	
	Возврат Ответ;
	
КонецФункции

Функция НужноПечатьФорму(Документ, ПечатнаяФорма, СоставКомплекта) Экспорт
	
	Если ТипЗнч(Документ) <> тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НужноПечатать = Ложь;
	
	Если Документ.ФормируетсяСчет Тогда
		СтрокаКомплекта = СоставКомплекта.Найти(ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет"),"ВидДокументаКомплекта");
		Если СтрокаКомплекта <> Неопределено Тогда
			НавигационнаяСсылкаМакетаКомплекта = ПолучитьНавигационнуюСсылку(СтрокаКомплекта.ПодключаемыйОбъект);
			НужноПечатать =  НавигационнаяСсылкаМакетаКомплекта = ПечатнаяФорма.НавигационнаяСсылка;
		КонецЕсли;
	КонецЕсли; 
	
	Если Документ.ФормируетсяАкт или Документ.ФормируетсяСчетФактура Тогда
		СтрокаКомплекта = СоставКомплекта.Найти(ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Реализация"),"ВидДокументаКомплекта");
		Если СтрокаКомплекта <> Неопределено Тогда
			НавигационнаяСсылкаМакетаКомплекта = ПолучитьНавигационнуюСсылку(СтрокаКомплекта.ПодключаемыйОбъект);
			НужноПечатать =  НавигационнаяСсылкаМакетаКомплекта = ПечатнаяФорма.НавигационнаяСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НужноПечатать;
	
КонецФункции

Функция ПроверитьЗадолженность(ВебПрофиль, КодЯзыка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	СКД = Справочники.CW_ВебПрофили.ПолучитьМакет("ДебиторскаяЗадолженность");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);  
	
	Настройки 	= ВебПрофиль.НастройкиОтбораОтчетЗадоженность.Получить();
	Для Каждого ЭлементОтбораДС Из Настройки.Отбор.Элементы Цикл
		ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ЭлементОтбораСКД, ЭлементОтбораДС);
	КонецЦикла;
	
   	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ТРезультат	= Новый ТаблицаЗначений;    
	ПроцессорВыводаВТЗ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаВТЗ.УстановитьОбъект(ТРезультат);    
	ТРезультат = ПроцессорВыводаВТЗ.Вывести(ПроцессорКомпоновкиДанных);   
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаЗапроса.Валюта КАК Валюта,
	               |	ТаблицаЗапроса.Счет КАК Счет,
	               |	ТаблицаЗапроса.ПросроченноВалСумма КАК ПросроченноСумма
	               |ПОМЕСТИТЬ ВТ_Таблица
	               |ИЗ
	               |	&ТаблицаЗапроса КАК ТаблицаЗапроса
	               |ГДЕ
	               |	ТаблицаЗапроса.ПросроченноВалСумма > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Таблица.Валюта КАК Валюта,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Таблица.Счет) КАК Счет,
	               |	СУММА(ВТ_Таблица.ПросроченноСумма) КАК ПросроченноСумма
	               |ИЗ
	               |	ВТ_Таблица КАК ВТ_Таблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Таблица.Валюта";
	
	Запрос.УстановитьПараметр("ТаблицаЗапроса", ТРезультат);  
	
	КодСостояния	= 200;
	ТекстОповещения = "";
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		МассивСтрок_RU = Новый Массив;
		МассивСтрок_EN = Новый Массив;
		
		КодСостояния = 302; 
		
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока("Уважаемый клиент!", Новый Шрифт(,,Истина))); 
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока("Ваша компания имеет просроченную задолженность:"));
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		
		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока("Dear customer!", Новый Шрифт(,,Истина))); 
		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока("Your company has overdue debt:"));
		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		
		ШаблонСтроки_RU = " - по %1 счетам(у) на сумму %2 %3";  
		ШаблонСтроки_EN = " - on %1 invoice(s) in the amount of %2 %3";			
		
		Пока Выборка.Следующий() Цикл   
			
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(" - по "));
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(СокрЛП(Выборка.Счет), Новый Шрифт(,,,,Истина))); 
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(" счетам(у)", Новый Шрифт(,,,,Истина)));
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(" на сумму "));
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(Формат(Выборка.ПросроченноСумма,"ЧДЦ=2"), Новый Шрифт(,,Истина))); 
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(" " + СокрЛП(Выборка.Валюта), Новый Шрифт(,,Истина))); 
			МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
			
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока("- on "));
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(СокрЛП(Выборка.Счет), Новый Шрифт(,,,,Истина))); 
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(" invoice(s)", Новый Шрифт(,,,,Истина))); 
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(" in the amount of ")); 
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(Формат(Выборка.ПросроченноСумма,"Л=en; ЧДЦ=2"), Новый Шрифт(,,Истина))); 
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(" " + СокрЛП(Выборка.Валюта), Новый Шрифт(,,Истина))); 
			МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));

		КонецЦикла;  
		
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		МассивСтрок_RU.Добавить(Новый ФорматированнаяСтрока("Более подробную информацию о сумме долга Вы можете найти в разделе ""Отчеты"".", Новый Шрифт(,,Истина)));

		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		МассивСтрок_EN.Добавить(Новый ФорматированнаяСтрока("You can you can find more detailed information about the amount of debt in the ""Reports"" section.", Новый Шрифт(,,Истина)));
		
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("ru", МассивСтрок_RU);
		СтруктураОповещения.Вставить("en", МассивСтрок_EN);
		
		МассивСтрок = СтруктураОповещения[НРег(КодЯзыка)]; 
		ФорматированнаяСтрока = новый ФорматированнаяСтрока(МассивСтрок);

		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьФорматированнуюСтроку(ФорматированнаяСтрока); 
		
		ФорматированныйДокумент.ПолучитьHTML(ТекстОповещения,  Новый Структура);

	КонецЕсли;  
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния",		КодСостояния);
	Результат.Вставить("ТекстОповещения",	ТекстОповещения);
	
	Возврат Результат;

КонецФункции

 
Функция ПолучитьТаблицуДокументов(ОсновнойПрофиль, ДатаНачала, ДатаОкончания, ПараметрыКомплекта) Экспорт
	
	СКД = Справочники.CW_ВебПрофили.ПолучитьМакет("СхемаОтбораДокументов");
	
	Настройки = ОсновнойПрофиль.НастройкиОтбораДокументов.Получить();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;    
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);    
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию); 
	
	Для Каждого КлючЗначение из ПараметрыКомплекта Цикл
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;   
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 	ДатаНачала);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 	ДатаОкончания);
	
	Если Настройки <> Неопределено Тогда
		Для Каждого ЭлементОтбораДС Из Настройки.Отбор.Элементы Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементОтбораДС);
		КонецЦикла;
	КонецЕсли;

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ТаблицаДокументов = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаДокументов;
	
КонецФункции  

Функция ПолучитьДанныеОтчетаПоЗадолженности(ВебПрофиль, КлючВарианта = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СКД = Отчеты.CW_ЛичныйКабинетДебиторскаЗадолженность.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если Не ПустаяСтрока(КлючВарианта) Тогда
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоРеквизиту("КлючВарианта", КлючВарианта);
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	Если ЗначениеЗаполнено(ВариантОтчета) Тогда    
		НастройкиВариантаОтчета = ВариантОтчета.Настройки.Получить();
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВариантаОтчета);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию); 
	КонецЕсли;
	
	НастройкиОтбораПрофиля 	= ВебПрофиль.НастройкиОтбораОтчетЗадоженность.Получить();
	Для Каждого ЭлементОтбораПрофиля Из НастройкиОтбораПрофиля.Отбор.Элементы Цикл
		ЭлементОтбораОтчета = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ЭлементОтбораОтчета, ЭлементОтбораПрофиля);
	КонецЦикла;        
	
	ДанныеРасшифровки 	= Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;    
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;    
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	//Обработка расшифровку для передачи в ЛКК   
	Расшифровка = ОбработатьРезультатРасшифровки(ДанныеРасшифровки, "Счет");
	
	ДанныеОтчета = Новый Структура;
	ДанныеОтчета.Вставить("Результат",		ТабличныйДокумент);
	ДанныеОтчета.Вставить("Расшифровка",	Расшифровка);
	
	Возврат ДанныеОтчета;

КонецФункции

Функция ОбработатьРезультатРасшифровки(Знач ДанныеРасшифровки, Поля="")
	
	Расшифровка = Новый Соответствие;
	Для Каждого ЭлементРасшифровки из ДанныеРасшифровки.Элементы Цикл
		Если ТипЗнч(ЭлементРасшифровки) <> Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементРасшифровки.ОсновноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда 
			Продолжить;
		КонецЕсли;   
		
		ТекущееЗначение = Неопределено;
		ПервоеПоле = ЭлементРасшифровки.ПолучитьПоля()[0]; 
		Если ПустаяСтрока(Поля) Тогда 
			ТекущееЗначение = XMLСтрока(ПервоеПоле.Значение); 
		ИначеЕсли СтрНайти(Поля, ПервоеПоле.Поле) > 0 Тогда 
			ТекущееЗначение = XMLСтрока(ПервоеПоле.Значение); 
		КонецЕсли;
		
		Если ТекущееЗначение <> Неопределено Тогда
			Расшифровка.Вставить(ЭлементРасшифровки.Идентификатор, ТекущееЗначение); 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Расшифровка;

КонецФункции      

Функция ПолучитьТаблицуГрузоперевозок(ВебПрофиль, Вариант) Экспорт
	
	УбратьСсылкуНаГП = Ложь;
	
	СКД = Справочники.CW_ВебПрофили.ПолучитьМакет("СхемаПараметров");
	
	Настройки = ВебПрофиль.НастройкиОсновногоОтбора.Получить();
	НастройкиКомпоновкиДанных     = СКД.НастройкиПоУмолчанию;
	
	Таб = Новый ТаблицаЗначений;    
	ПроцессорВыводаВТЗ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаВТЗ.УстановитьОбъект(Таб);    
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);   
	
	ВыводитьФинансовыеДокументы = ВебПрофиль.ОсновнойПрофиль.ВыводитьФинансовыеДокументы; 
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТребуютсяДокументы", ВыводитьФинансовыеДокументы);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТребуютсяФайлы", 	ВебПрофиль.ВыгружатьФайлы);

	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	Для Каждого Стр Из ВебПрофиль.СтруктураПрофиля Цикл
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = Стр.Заголовок;
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(Стр.СтрокаПоляКомпоновки);
		НовоеПоле.Использование = Истина;
	КонецЦикла;
	
	СсылкаНаГП =  ВебПрофиль.СтруктураПрофиля.Найти("Ссылка","СтрокаПоляКомпоновки");
	Если СсылкаНаГП = Неопределено Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		НовоеПоле.Использование = Истина;
		УбратьСсылкуНаГП = Истина;		
	КонецЕсли;
	
	НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЕстьФайлы");
	НовоеПоле.Использование = Истина;
	
	НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЕстьДокументы");
	НовоеПоле.Использование = Истина;
	
	мТипыДокументов = ВебПрофиль.ТипыФайлов.ВыгрузитьКолонку("Тип");
	
	Если мТипыДокументов.Количество() > 0 Тогда
		СписокТипыДокументов = Новый СписокЗначений;
		СписокТипыДокументов.ЗагрузитьЗначения(мТипыДокументов);
		
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыДокументов", СписокТипыДокументов);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьОграниченияПоТипуДокументов", Истина);
	КонецЕсли;
	
	Если Настройки <> Неопределено Тогда
		_УФС.СкопироватьОтбор(Настройки.Отбор, КомпоновщикНастроек.Настройки.Отбор);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВебПрофиль.ИдентификаторАрхивныхГрузоперевозок) Тогда 
		Если Вариант = 0 Тогда 
			ГруппаОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаОтбора.Использование = Истина;
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+ВебПрофиль.ИдентификаторАрхивныхГрузоперевозок.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ЭлементОтбораСКД.ПравоеЗначение = Истина;   
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+ВебПрофиль.ИдентификаторАрхивныхГрузоперевозок.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
		ИначеЕсли Вариант = 1 Тогда   
			ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+ВебПрофиль.ИдентификаторАрхивныхГрузоперевозок.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСКД.ПравоеЗначение = Истина;   
		КонецЕсли;
	КонецЕсли;
	
	//Сортировка
	Если ВебПрофиль.ПоляСортировки.Количество() > 0 Тогда
		Для Каждого СтрокаПорядка из  ВебПрофиль.ПоляСортировки Цикл
			ЭлементПорядка = КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(СтрокаПорядка.СтрокаПоляКомпоновки); 
			ЭлементПорядка.Использование = истина;
			Если СтрокаПорядка.Сортировка = ПредопределенноеЗначение("Перечисление.CW_ПорядокСортировки.ПоВозрастанию") Тогда
				ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			Иначе
				ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Сортировка
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	Таб = ПроцессорВыводаВТЗ.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Таб;
	
КонецФункции
 
Функция ПолучитьТаблицуЗаявок(Знач Профиль, Знач ШаблонПрофиля, Знач СтатусЗаявок, Знач Язык="RU", СкрытьПолеСсылка) Экспорт
	
	СКД = ПолучитьОбщийМакет("CW_ЗаявкиСхемаПараметров");
	
	НастройкиОсновногоОтбора  = Профиль.НастройкиОсновногоОтбора.Получить();
	НастройкиКомпоновкиДанных = СКД.НастройкиПоУмолчанию;  
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);   
	
	//Формирование колонок таблицы  
	ДобавитьПолеСсылка = Истина;
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();    
	Для Каждого СтрокаТаблицы Из ШаблонПрофиля.СтруктураПрофиля Цикл
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаТаблицы.СтрокаПоляКомпоновки);    
		НовоеПоле.Заголовок 	= НСтр("ru='"+СтрокаТаблицы.ЗаголовокRU+"';en='"+СтрокаТаблицы.ЗаголовокEN+"'", Язык);
		
		Если СтрокаТаблицы.СтрокаПоляКомпоновки = "Ссылка" Тогда
			ДобавитьПолеСсылка 	= Ложь; 
			СкрытьПолеСсылка 	= Истина;
		КонецЕсли;
	КонецЦикла;  
	
	Если ДобавитьПолеСсылка Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Вставить(0, Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		НовоеПоле.Заголовок 	= НСтр("ru='Заявка';en='Request'", Язык);
	КонецЕсли;
	
	Если Профиль.ВыгружатьФайлы Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("ЕстьФайлы");
		НовоеПоле.Использование = Истина;
	КонецЕсли;  
	//Формирование колонок таблицы 
	
	//Параметры данных   
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТребуютсяФайлы", Профиль.ВыгружатьФайлы);
	
	мТипыДокументов = Профиль.ТипыФайлов.ВыгрузитьКолонку("Тип");
	Если мТипыДокументов.Количество() > 0 Тогда
		СписокТипыДокументов = Новый СписокЗначений;
		СписокТипыДокументов.ЗагрузитьЗначения(мТипыДокументов);
		
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыДокументов", СписокТипыДокументов);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьОграниченияПоТипуДокументов", Истина);
	КонецЕсли;
	//Параметры данных
	
	//Отбор  
	Если НастройкиОсновногоОтбора <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиОсновногоОтбора.Отбор, КомпоновщикНастроек.Настройки.Отбор);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Профиль.ИдентификаторАрхива) Тогда
		Если СтатусЗаявок = 0 Тогда //Открытые
			ГруппаОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаОтбора.Использование = Истина;
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСКД.ПравоеЗначение = Ложь;
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		КонецЕсли;
		
		Если СтатусЗаявок = 1 Тогда //в архиве
			ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСКД.ПравоеЗначение = Истина;
		КонецЕсли;   
	КонецЕсли;
	//Отбор  
	
	//Сортировка
	Если ШаблонПрофиля.ПоляСортировки.Количество() > 0 Тогда 
		
		Для Каждого СтрокаПорядка из ШаблонПрофиля.ПоляСортировки Цикл 
			ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			Если СтрокаПорядка.Сортировка = ПредопределенноеЗначение("Перечисление.CW_ПорядокСортировки.ПоУбыванию") Тогда
				ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
			КонецЕсли; 
			
			ЭлементПорядка	= КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаПорядка.СтрокаПоляКомпоновки); 
			ЭлементПорядка.Использование 	= Истина;   
			ЭлементПорядка.ТипУпорядочивания = ТипУпорядочивания;
		КонецЦикла;  
		
	КонецЕсли;
	//Сортировка          

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
 	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ТаблицаЗначений = Новый ТаблицаЗначений;    

	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Функция ПолучитьТаблицуПеревозок(Знач ОсновнойПрофиль, Знач Профиль, Знач ШаблонПрофиля, Знач СтатусПеревозок, Знач Язык="RU", СкрытьПолеСсылка) Экспорт
	
	СКД = ПолучитьОбщийМакет("CW_ПеревозкиСхемаПараметров");
	
	НастройкиОсновногоОтбора  = Профиль.НастройкиОсновногоОтбора.Получить();
	НастройкиКомпоновкиДанных = СКД.НастройкиПоУмолчанию;  
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);   
	
	//Формирование колонок таблицы  
	ДобавитьПолеСсылка = Истина;
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();    
	Для Каждого СтрокаТаблицы Из ШаблонПрофиля.СтруктураПрофиля Цикл
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаТаблицы.СтрокаПоляКомпоновки);    
		НовоеПоле.Заголовок 	= НСтр("ru='"+СтрокаТаблицы.ЗаголовокRU+"';en='"+СтрокаТаблицы.ЗаголовокEN+"'", Язык);
		
		Если СтрокаТаблицы.СтрокаПоляКомпоновки = "Ссылка" Тогда
			ДобавитьПолеСсылка 	= Ложь; 
			СкрытьПолеСсылка 	= Истина;
		КонецЕсли;
	КонецЦикла;  
	
	Если ДобавитьПолеСсылка Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Вставить(0, Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		НовоеПоле.Заголовок 	= НСтр("ru='Заявка';en='Request'", Язык);
	КонецЕсли;
	
	Если Профиль.ВыгружатьФайлы Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("ЕстьФайлы");
		НовоеПоле.Использование = Истина;
	КонецЕсли;   

	Если ОсновнойПрофиль.ВыводитьФинансовыеДокументы Тогда
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("ЕстьДокументы");
		НовоеПоле.Использование = Истина;
	КонецЕсли;  
	//Формирование колонок таблицы 
	
	//Параметры данных   
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТребуютсяФайлы", 	Профиль.ВыгружатьФайлы);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТребуютсяДокументы", ОсновнойПрофиль.ВыводитьФинансовыеДокументы);   
	
	мТипыДокументов = Профиль.ТипыФайлов.ВыгрузитьКолонку("Тип");
	Если мТипыДокументов.Количество() > 0 Тогда
		СписокТипыДокументов = Новый СписокЗначений;
		СписокТипыДокументов.ЗагрузитьЗначения(мТипыДокументов);
		
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыДокументов", СписокТипыДокументов);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьОграниченияПоТипуДокументов", Истина);
	КонецЕсли;
	//Параметры данных
	
	//Отбор  
	Если НастройкиОсновногоОтбора <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиОсновногоОтбора.Отбор, КомпоновщикНастроек.Настройки.Отбор);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Профиль.ИдентификаторАрхива) Тогда
		Если СтатусПеревозок = 0 Тогда //Открытые
			ГруппаОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаОтбора.Использование = Истина;
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСКД.ПравоеЗначение = Ложь;
			
			ЭлементОтбораСКД = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			//ЭлементОтбораСКД.ПравоеЗначение = Истина;
		КонецЕсли;
		
		Если СтатусПеревозок = 1 Тогда //в архиве
			ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка."+Профиль.ИдентификаторАрхива.Идентификатор);
			ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораСКД.ПравоеЗначение = Истина;
		КонецЕсли;   
	КонецЕсли;   
	//Отбор  
	
	//Сортировка
	Если ШаблонПрофиля.ПоляСортировки.Количество() > 0 Тогда 
		
		Для Каждого СтрокаПорядка из ШаблонПрофиля.ПоляСортировки Цикл 
			ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			Если СтрокаПорядка.Сортировка = ПредопределенноеЗначение("Перечисление.CW_ПорядокСортировки.ПоУбыванию") Тогда
				ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
			КонецЕсли; 
			
			ЭлементПорядка	= КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаПорядка.СтрокаПоляКомпоновки); 
			ЭлементПорядка.Использование 	= Истина;   
			ЭлементПорядка.ТипУпорядочивания = ТипУпорядочивания;
		КонецЦикла;  
		
	КонецЕсли;
	//Сортировка          

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
 	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ТаблицаЗначений = Новый ТаблицаЗначений;    

	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура МониторПоддержкиПолучитьИнформацию(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СервисИспользуется = Константы.CW_ЛичныйКабинетИспользуется.Получить();
	
	ДанныеСервиса = Новый Структура;
	ДанныеСервиса.Вставить("Используется",  			СервисИспользуется); 
	ДанныеСервиса.Вставить("Ошибка", 					Ложь);	
	ДанныеСервиса.Вставить("СоответствуетМинимальной", 	Ложь);	
	ДанныеСервиса.Вставить("ИгнорироватьМинимальнуюВерсию", 	Ложь);	
	ДанныеСервиса.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Ложь);		
	ДанныеСервиса.Вставить("МинимальнаяВерсия", 			"<...>");	
	ДанныеСервиса.Вставить("РекомендуемаяВерсия", 			"<...>");	
	ДанныеСервиса.Вставить("Тариф", 						"<...>");	
	ДанныеСервиса.Вставить("ДатаНачала", 					"<...>");	
	ДанныеСервиса.Вставить("ДатаОкончания", 				"<...>");	
	ДанныеСервиса.Вставить("АвтоматическиВыписыватьСчета",	Ложь); 
	
	Если СервисИспользуется Тогда
		Результат = СведенияСервисеЛичныйКабинетКлиента();
		
		Если Результат = Неопределено или Результат.КодСостояния <> 200 Тогда
			ДанныеСервиса.Вставить("Ошибка", Истина);
		Иначе
			ДанныеСервиса.Вставить("МинимальнаяВерсия", 				Результат.МинимальнаяВерсия);	
			ДанныеСервиса.Вставить("РекомендуемаяВерсия", 				Результат.РекомендуемаяВерсия);	
			ДанныеСервиса.Вставить("СоответствуетМинимальной", 			Результат.СоответствуетМинимальной);	
			ДанныеСервиса.Вставить("ИгнорироватьМинимальнуюВерсию",		Результат.ИгнорироватьМинимальнуюВерсию);	
			ДанныеСервиса.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Результат.ИгнорироватьРекомендуемуюВервсию);	
			ДанныеСервиса.Вставить("АвтоматическиВыписыватьСчета", 		Результат.АвтоматическиВыписыватьСчета);	
			
			ДанныеСервиса.Вставить("Тариф", 			Результат.Тариф);	
			ДанныеСервиса.Вставить("ДатаНачала", 		Результат.ДатаНачала);	
			ДанныеСервиса.Вставить("ДатаОкончания", 	Результат.ДатаОкончания);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДанныеСервиса, АдресРезультата);
	
КонецПроцедуры   

Функция СведенияСервисеЛичныйКабинетКлиента() Экспорт
	
	Результат = Новый Структура;   
	Результат.Вставить("КодСостояния",				Неопределено);
	Результат.Вставить("МинимальнаяВерсия",			"<...>"); 
	Результат.Вставить("РекомендуемаяВерсия",		"<...>"); 
	Результат.Вставить("Тариф",			 			"<...>"); 
	Результат.Вставить("ДатаНачала",				"<...>"); 
	Результат.Вставить("ДатаОкончания",	 			"<...>"); 
 	Результат.Вставить("Состояние",	 				"<...>"); 
	Результат.Вставить("СоответствуетМинимальной",			Ложь); 
  	Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		Ложь); 
	Результат.Вставить("ИгнорироватьРекомендуемуюВервсию",	Ложь); 
	Результат.Вставить("АвтоматическиВыписыватьСчета",		Ложь); 
 
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	Если ПустаяСтрока(РегистрационныйНомер) Тогда
		Результат.Вставить("КодСостояния",	403);
		Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Возврат Результат;
	КонецЕсли;
	
	versionaf 					= CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
	
	СтрукутраJSON = Новый Структура;
	СтрукутраJSON.Вставить("versionaf",	XMLСтрока(versionaf));
	СтрукутраJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер)); 

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_lkkinfo", СтрукутраJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		
		СтруктураОтветJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		
		Результат.Вставить("МинимальнаяВерсия",			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.minversionaf)); 
		Результат.Вставить("РекомендуемаяВерсия",		XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.recversionaf)); 
		Результат.Вставить("Тариф",			 			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.rate)); 
		Результат.Вставить("ДатаНачала",				XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.startdate)); 
		Результат.Вставить("ДатаОкончания",	 			XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.enddate)); 
		Результат.Вставить("СоответствуетМинимальной",	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.respondmin)); 

		Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignoreminversionaf));	
		Результат.Вставить("ИгнорироватьРекомендуемуюВервсию", 	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignorerecversionaf));	
		Результат.Вставить("АвтоматическиВыписыватьСчета", 		XMLЗначение(Тип("Булево"),	СтруктураОтветJSON.autoinvoice));  

	КонецЕсли;        
	
	Возврат Результат;   
	
КонецФункции

Процедура ОбновитьДанныеАвтоматическойВыпискиСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт

	Результат = Новый Структура;
	
	СервисИспользуется = Константы.CW_ЛичныйКабинетИспользуется.Получить();
	
	Если СервисИспользуется Тогда 
		
		РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
		Если ПустаяСтрока(РегистрационныйНомер) Тогда
			Результат.Вставить("КодСостояния",	403);
			Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Иначе
			
			versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
			
			СтруктураJSON = Новый Структура;
			СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер)); 
			СтруктураJSON.Вставить("autoinvoice",	XMLСтрока(ПараметрыПроцедуры.Значение)); 
			
			ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_autoinvoice", СтруктураJSON);
			
			Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");
			Результат.Вставить("КодСостояния", 	Ответ.КодСостояния);
			Результат.Вставить("Состояние", 	Ответ.ПолучитьтелоКакСтроку());
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры
